Revit 2027 API
CurtainCell.CurveLoops Property
The cell boundaries on the reference face. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArrArray CurveLoops { get; }
Public ReadOnly Property CurveLoops As CurveArrArray
	Get
public:
property CurveArrArray^ CurveLoops {
	CurveArrArray^ get ();
}
member CurveLoops : CurveArrArray with get
Property Value
CurveArrArray
See Also
Reference
CurtainCell Class
Autodesk.Revit.DB Namespace